create_clock -period 4.000 -name ap_clk -waveform {0.000 2.000} [get_ports ap_clk]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_bresp[*]}]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_bresp[*]}]
set _xlnx_shared_i0 [get_ports {m00_axi_rdata[*]}]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 $_xlnx_shared_i0
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 $_xlnx_shared_i0
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_rresp[*]}]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_rresp[*]}]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {s_axi_control_araddr[*]}]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {s_axi_control_araddr[*]}]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {s_axi_control_awaddr[*]}]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {s_axi_control_awaddr[*]}]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {s_axi_control_wdata[*]}]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {s_axi_control_wdata[*]}]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {s_axi_control_wstrb[*]}]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {s_axi_control_wstrb[*]}]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports ap_rst_n]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports ap_rst_n]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_arready]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_arready]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_awready]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_awready]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_bvalid]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_bvalid]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_rlast]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_rlast]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_rvalid]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_rvalid]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_wready]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_wready]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_arvalid]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_arvalid]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_awvalid]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_awvalid]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_bready]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_bready]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_rready]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_rready]
set_input_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_wvalid]
set_input_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_wvalid]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_araddr[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_araddr[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_arburst[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_arburst[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_arcache[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_arcache[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_arlen[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_arlen[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_arprot[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_arprot[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_arqos[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_arqos[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_arsize[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_arsize[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awaddr[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awaddr[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awburst[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awburst[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awcache[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awcache[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awlen[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awlen[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awprot[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awprot[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awqos[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awqos[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awsize[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awsize[*]}]
set _xlnx_shared_i1 [get_ports {m00_axi_wdata[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 $_xlnx_shared_i1
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 $_xlnx_shared_i1
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_wstrb[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_wstrb[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {s_axi_control_rdata[*]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {s_axi_control_rdata[*]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports interrupt]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports interrupt]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_arlock[0]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_arlock[0]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_arvalid]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_arvalid]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports {m00_axi_awlock[0]}]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports {m00_axi_awlock[0]}]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_awvalid]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_awvalid]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_bready]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_bready]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_rready]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_rready]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_wlast]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_wlast]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports m00_axi_wvalid]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports m00_axi_wvalid]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_arready]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_arready]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_awready]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_awready]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_bvalid]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_bvalid]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_rvalid]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_rvalid]
set_output_delay -clock [get_clocks ap_clk] -min -add_delay 0.000 [get_ports s_axi_control_wready]
set_output_delay -clock [get_clocks ap_clk] -max -add_delay 0.000 [get_ports s_axi_control_wready]
